Revit 2027 API
PartUtils.HasAssociatedParts(Document, LinkElementId) Method
 Checks if an element has associated parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool HasAssociatedParts(
	Document hostDocument,
	LinkElementId hostOrLinkElementId
)
Public Shared Function HasAssociatedParts (
	hostDocument As Document,
	hostOrLinkElementId As LinkElementId
) As Boolean
public:
static bool HasAssociatedParts(
	Document^ hostDocument,
	LinkElementId^ hostOrLinkElementId
)
static member HasAssociatedParts :
        hostDocument : Document *
        hostOrLinkElementId : LinkElementId -> bool
Parameters
hostDocument Document
 The document.
hostOrLinkElementId LinkElementId
 The element to be checked for associated Parts.
Return Value
Boolean
 True if the element has associated Parts.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
HasAssociatedParts Overload
Autodesk.Revit.DB Namespace